# 2.2 Работа с кодом: модули и импорт

# В первой строке дано три числа, соответствующие некоторой дате date -- год, месяц и день.
# Во второй строке дано одно число days -- число дней.
# Вычислите и выведите год, месяц и день даты, которая наступит, когда с момента исходной даты date пройдет число дней, равное days.

# Примечание:
# Для решения этой задачи используйте стандартный модуль datetime.
# Вам будут полезны класс datetime.date для хранения даты и класс datetime.timedelta﻿ для прибавления дней к дате.

# Sample Input 1:
# 2016 4 20
# 14

# Sample Output 1:
# 2016 5 4

import datetime as dt

data = dt.datetime(*map(int, input().split()))
dl = dt.timedelta(days=int(input()))
print((data + dl).year, (data + dl).month, (data + dl).day)
