# 3.2 Стандартные методы и функции для строк

# Вашей программе на вход подаются три строки s, a, b, состоящие из строчных латинских букв. За одну операцию вы можете
# заменить все вхождения строки a в строку s на строку b.
# Например, s = "abab", a = "ab", b = "ba", тогда после выполнения одной операции строка s перейдет в строку "baba",
# после выполнения двух и операций – в строку "bbaa", и дальнейшие операции не будут изменять строку s.
# Необходимо узнать, после какого минимального количества операций в строке s не останется вхождений строки a.
# Если операций потребуется более 1000, выведите Impossible.
# Выведите одно число – минимальное число операций, после применения которых в строке s не останется вхождений строки a,
# или Impossible, если операций потребуется более 1000.

# Условие задачи было изменено 12.09.2018
# Sample Input 1:
# ababa
# a
# b

# Sample Output 1:
# 1

s, a, b, n = [input() for i in range(3)] + [0]
while True:
    if s.find(a) != -1:
        s = s.replace(a, b)
        n += 1
        if n == 1000:
            print("Impossible")
            break
    else:
        print(n)
        break
